{
  "919069517504720931": {
    "name": "Ritesh",
    "description": "I’m a robotics lead, programmer, and builder of systems—both in code and in life. Over two years in FRC Team 201, I’ve led engineering projects in Python, C++, and Java. I’m a full-stack developer with working knowledge of at least seven programming languages, and I’ve built powerful tools—like an AI firewall—to protect myself and others from negativity. I run two STEM-based clubs, mentor young coders, and I’m proud to be part of the Google Developer Community. A lot of people reach out to me for guidance, and even more say they’ve been inspired by me. That responsibility means something to me. Outside of the tech world, I’ve lived through pain. I’ve been hurt in ways I still carry with me, and some memories bring tears even now. I’ve experienced racism, been bullied, and felt isolated—those scars don’t just fade. I used to have anger bottled up inside me, and I still get mad over small things sometimes. But I’ve changed—because of one person. She’s no longer alive, but she’s the reason I became the person I am today. I still like to think she’s with me, helping me through the hurdles I face. I’m emotionally driven. I don’t make friends easily—I have trust issues—but the few I let in, I protect fiercely. People tell me things they’ve never told anyone else, and I hold that trust like it’s sacred. I can often tell immediately if someone’s being genuine, and I adjust how I act depending on who’s around me. I don’t like phone calls; I prefer texting. Only a few people have unrestricted access to me, and I guard that boundary closely. Music is one of the rare things that helps me breathe. I play piano, a bit of guitar, and I’ve learned to listen more than I speak. I overthink everything—I like to have a plan before I act—but when I do move, I do it with purpose. I’ve built a digital wall around myself—not to push people away, but to protect the version of me I’ve worked hard to grow into. And for all my tech, all my logic, and all my caution, I still have a soft spot—for anyone vulnerable, and especially for Indian girls. When someone calls me `Anna` (brother, in Tamil), it means more to me than they probably know. It makes me feel responsible, like I need to protect them, no matter what. I care deeply, even when I don’t show it. I fear losing people, but I try not to take on problems I can’t solve. Still, I’m always here—learning, building, growing, and trying to be someone worth depending on.",
    "team": "201",
    "role": "Programming Lead, Senior, Mentor, Builder, Teacher, Human",
    "location": "Rochester Hills",
    "discord_id": "919069517504720931",
    "discord_username": "riteshrajas",
    "discord_display_name": "Ritesh Raj",
    "created_at": "2025-07-10T18:53:18.580Z",
    "updated_at": "2025-07-11T21:17:56.315Z",
    "webhook_url": "https://discord.com/api/webhooks/1393340554900668479/LeoVc-JMvx1tSzqZN0O9M_G--Zj3z27dP4zD7hu-oV5FR7G_kr8HR-lVJkb7VhyAYyTn"
  },
  "1058878092778672169": {
    "name": "Clifford St. Clair",
    "description": "Outstanding musician playing 4 instruments,\nOwns 2 cats\nTeam 201 Programming lead, drive team member\nseriously skilled at fortnite battle royals, robotics whiz, code-slinging strategist, looping pedal enthusiast, cat-to-human alchemist, always-on learner, FRC mastermind, formatting perfectionist, and the guy who somehow makes debugging look cool Clifford S. is a versatile and driven student with a strong focus on robotics, programming, and technical problem-solving. He’s been actively involved in the FIRST Robotics Competition (FRC), where he has developed a solid understanding of Java, WPILib, and the architecture of modern robot control systems. From subsystems like elevators and turrets to implementing state machines and path planning, Clifford shows a clear aptitude for thinking through both the logic and structure of competitive robotics programming. In addition to his technical skills, Clifford demonstrates a strong sense of initiative and leadership. He has taken an interest in team dynamics, communication, and documentation, often working to clarify roles within his robotics team and improve training materials for others. He values precision and accessibility in his work, whether he’s naming code repositories or helping others understand programming fundamentals like variable types and class structure. Outside of robotics, Clifford also explores creative interests, particularly in music and digital design. He’s shown curiosity about live looping setups, indie rock bands, and performance techniques, blending his technical mindset with artistic expression. This same creativity shows up in playful projects like visual edits, logo design, and even imaginative transformations—like turning his cat into a human character. Clifford has also developed experience with a range of technical tools beyond robotics, including Git, Node.js, MDX, and VS Code. He regularly seeks out deeper understanding of how things work and isn’t afraid to dive into everything from stash management in Git to embedding images in code-based documentation. His approach to learning is hands-on and iterative, often balancing attention to detail with broader project goals.Overall, Clifford S. stands out as a curious and well-rounded individual who bridges the gap between engineering precision and creative exploration. He brings a thoughtful, motivated attitude to every project—whether it’s guiding a robot across the field or formatting a perfectly styled presentation. His work reflects a blend of technical rigor, creative problem-solving, and a genuine enthusiasm for learning.",
    "team": "201",
    "role": "student",
    "location": "Michigan, USA",
    "discord_id": "1058878092778672169",
    "discord_username": "zombieking1555",
    "discord_display_name": "zombieking1555",
    "created_at": "2025-07-10T18:53:51.655Z",
    "updated_at": "2025-07-11T21:19:07.735Z",
    "webhook_url": "https://discord.com/api/webhooks/1393340854961442826/ccmZKMHw_gA-v2CXqGUI-38s71BNH7PrLDw5hsQanPqmUTT_oc4L0lb4g6DDuYw6lK1x"
  },
  "1134653967629025300": {
    "name": "Gunhong Min",
    "description": "3rd year",
    "team": "201",
    "role": "student",
    "location": "usa",
    "discord_id": "1134653967629025300",
    "discord_username": "gm.5.h",
    "discord_display_name": "Gunhong Min",
    "created_at": "2025-07-10T18:55:26.500Z",
    "updated_at": "2025-07-11T21:07:08.048Z",
    "webhook_url": "https://discord.com/api/webhooks/1393337835330736138/0NGi_4gp__dT7BihVfUDsPPWgARPiLN5g-ZBeqp-h_KVgEyErwUf4TOldEQpKgwya4Px"
  },
  "690690814145200159": {
    "name": "Laney Williams",
    "description": "I’m a blonde American and pretty patient.I’ve got two dogs: Charlotte, who’s definitely my favorite, and Willy, I’m a little scared of him. This is my second year in FEDS Robotics as a programmer, and I’m trying for Drive Team When I’m into something, I actually put effort into I’m not afraid to ask for help, and once someone tells me something, I usually don’t need to be reminded again. I know when to take things seriously and when it’s okay to laugh stuff off. I’m outgoing, kind of chaotic in a fun way, and I get a weird amount of joy from mildly irritating people — nothing mean, just enough to keep things interesting.",
    "team": "201",
    "role": "Programmer and Member of Drive Team",
    "location": "Rochester Hills, Michigan",
    "discord_id": "690690814145200159",
    "discord_username": "lane7709",
    "discord_display_name": "laney",
    "created_at": "2025-07-10T19:14:02.986Z",
    "updated_at": "2025-07-11T21:20:20.381Z",
    "webhook_url": "https://discord.com/api/webhooks/1393341159627161650/nw3X7BEEIUTequk8t9IcMtm-BNRxm3sx3HzgTx8adhRZbNOXNZuCR99NYXXlizzrI7nJ"
  },
  "841896957843996692": {
    "name": "David",
    "description": "Programming, soccer, gaming(valorant), maybe a little bit of Roblox, doomscrolling, Asian",
    "team": "201",
    "role": "Student",
    "location": "Jamaica",
    "discord_id": "841896957843996692",
    "discord_username": "d._.alvd.12",
    "discord_display_name": "Dalvdツ",
    "created_at": "2025-07-11T01:00:05.899Z",
    "updated_at": "2025-07-11T21:21:31.680Z",
    "webhook_url": "https://discord.com/api/webhooks/1393341458605408399/29gqUJ-vMiE9lDNwuDGTWWfoziLVm28SSR93HJDRwr_BdS3AzXFC00CAK0pSDP_chVXF"
  },
  "918972074884734986": {
    "name": "Ikshita",
    "description": "Epic fortniter",
    "team": "201",
    "role": "Student",
    "location": "Rochester Hills",
    "discord_id": "918972074884734986",
    "discord_username": "ikxi.",
    "discord_display_name": "Ikshita",
    "created_at": "2025-07-11T01:17:02.680Z",
    "updated_at": "2025-07-11T21:16:44.445Z",
    "webhook_url": "https://discord.com/api/webhooks/1393340253535993966/aldUkUl6UJShuun1VNU4l4PvlZc050nqRmsHujt3EVZobEcCpEzBlrYax7rsCe8yTuI0"
  },
  "1055219958214311937": {
    "name": "Akilan Ganeshbabu",
    "description": "Addicted to tecgh, nerd.",
    "team": "201",
    "role": "Student",
    "location": null,
    "discord_id": "1055219958214311937",
    "discord_username": "phantomporter",
    "discord_display_name": "PhantomJam",
    "created_at": "2025-07-11T03:34:25.858Z",
    "updated_at": "2025-07-11T21:11:55.569Z",
    "webhook_url": "https://discord.com/api/webhooks/1393339042367537216/uSSuK_4sjyFn4qlCNThOqcoZ5uPtWEvc9MzA6VejMJ_RyE8Et1LbBJ76yJTlj1PMWBuo"
  }
}